<template>
  <main class="p-4">
    <div class="grid grid-cols-4 gap-7">
      <!-- 文章数 -->
      <div class="col-span-4 md:col-span-1">
      <!-- 文章数 -->
        <div
            class="flex items-center h-full w-full px-5 py-7 mb-3 bg-white border border-gray-200 rounded-lg dark:bg-gray-800 dark:border-gray-700">
            <svg t="1747884422956" class="icon w-10 h-10" viewBox="0 0 1024 1024" version="1.1"
                 xmlns="http://www.w3.org/2000/svg" p-id="16633" width="200" height="200"><path d="M640.2048 519.6288H389.2224c-16.9472 0-30.72-13.7728-30.72-30.72s13.7728-30.72 30.72-30.72h250.9824c16.9472 0 30.72 13.7728 30.72 30.72s-13.7728 30.72-30.72 30.72zM640.2048 709.8368H389.2224c-16.9472 0-30.72-13.7728-30.72-30.72s13.7728-30.72 30.72-30.72h250.9824c16.9472 0 30.72 13.7728 30.72 30.72s-13.7728 30.72-30.72 30.72z" fill="#B11EFF" p-id="16634"></path><path d="M870.2976 518.0928c-16.9472 0-30.72 13.7728-30.72 30.72v227.0208c0 62.3616-50.7392 113.1008-113.0496 113.1008H302.9504c-62.3616 0-113.0496-50.7392-113.0496-113.1008V341.8112c0-62.3616 50.7392-113.0496 113.0496-113.0496h12.6464c12.288 59.4432 65.024 104.2432 128.0512 104.2432h142.1824c63.0272 0 115.7632-44.8 128.0512-104.2432h12.6464c62.3616 0 113.0496 50.7392 113.0496 113.0496 0 16.9472 13.7728 30.72 30.72 30.72s30.72-13.7728 30.72-30.72c0-96.2048-78.2848-174.4896-174.4896-174.4896h-14.7456c-15.36-55.1424-65.9456-95.744-125.952-95.744H443.648c-59.9552 0-110.592 40.6016-125.952 95.744h-14.7456c-96.2048 0-174.4896 78.2848-174.4896 174.4896v434.0224c0 96.2048 78.2848 174.5408 174.4896 174.5408h423.5264c96.2048 0 174.4896-78.2848 174.4896-174.5408v-227.0208c0.0512-16.9472-13.7216-30.72-30.6688-30.72zM443.648 133.0176h142.1824c38.1952 0 69.2736 31.0784 69.2736 69.2736 0 38.1952-31.0784 69.2736-69.2736 69.2736H443.648c-38.1952 0-69.2736-31.0784-69.2736-69.2736-0.0512-38.1952 31.0272-69.2736 69.2736-69.2736z" fill="#363F5B" p-id="16635"></path></svg>
            <div class="ml-5">
              <h2 class="mb-1">文章</h2>
              <CountTo :value="articleTotalCount" />
            </div>
          </div>
      </div>

      <!-- 分类数 -->
      <div class="col-span-4 md:col-span-1">
        <div
            class="flex items-center h-full w-full px-5 py-7 mb-3 bg-white border border-gray-200 rounded-lg dark:bg-gray-800 dark:border-gray-700">
            <svg t="1747884454088" class="icon w-10 h-10" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="19449" width="200" height="200"><path d="M716.2 538.3H574.9c-20.2 0-36.7 16.5-36.7 36.7v141.2c0 98.1 79.8 177.9 177.9 177.9 98.1 0 177.9-79.8 177.9-177.9s-79.7-177.9-177.8-177.9z m130.9 177.9c0 72.2-58.7 130.9-130.9 130.9s-130.9-58.7-130.9-130.9V585.3h130.9c72.2 0 130.9 58.7 130.9 130.9zM573 490.2h143.1c99.4 0 180.2-80.9 180.2-180.2s-80.9-180.2-180.2-180.2c-99.4 0-180.3 80.9-180.3 180.2v143c0.1 20.5 16.8 37.2 37.2 37.2z m10.4-47.5V309.9c0-73.2 59.6-132.8 132.8-132.8 73.2 0 132.8 59.6 132.8 132.8 0 73.2-59.6 132.8-132.8 132.8H583.4zM452 537.2H309.8c-98.7 0-179 80.3-179 179s80.3 179 179 179 179.1-80.3 179.1-179V574.1c0-20.4-16.6-36.9-36.9-36.9z m-10.3 47.2v131.8c0 72.7-59.1 131.8-131.8 131.8-72.7 0-131.8-59.1-131.8-131.8 0-72.7 59.1-131.8 131.8-131.8h131.8z" fill="#4E30DC" p-id="19450"></path><path d="M457.7 495.9c21 0 38.2-17.1 38.2-38.2V309.9c0-102.5-83.4-186-186-186-102.5 0-186 83.4-186 186s83.4 186 186 186h147.8z m-285.2-186c0-75.7 61.6-137.3 137.3-137.3 75.7 0 137.3 61.6 137.3 137.3v137.3H309.8c-75.7 0-137.3-61.6-137.3-137.3z" fill="#FF4E7D" p-id="19451"></path></svg>            <div class="ml-5">
              <h2 class="mb-1">分类</h2>
              <CountTo :value="categoryTotalCount" />
            </div>
          </div>
      </div>

      <!-- 标签数 -->
      <div class="col-span-4 md:col-span-1">
        <div class="flex items-center h-full w-full px-5 py-7 mb-3 bg-white border border-gray-200 rounded-lg dark:bg-gray-800 dark:border-gray-700">
            <svg t="1747884642088" class="icon w-10 h-10" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="27813" width="200" height="200"><path d="M223.8976 931.84a94.6176 94.6176 0 0 1-94.5152-94.5152V306.0224A192.4096 192.4096 0 0 1 321.536 113.8688h381.696a192.4096 192.4096 0 0 1 192.2048 192.1536v531.3536a94.5152 94.5152 0 0 1-148.48 77.3632l-50.3808-35.328a30.72 30.72 0 1 1 35.2768-50.3296l50.3808 35.3792a33.0752 33.0752 0 0 0 52.0192-27.0848V306.0224a130.8672 130.8672 0 0 0-130.7648-130.7136H321.536a130.8672 130.8672 0 0 0-130.7136 130.7136v531.3536a33.0752 33.0752 0 0 0 52.0192 27.0848l215.296-151.04a94.8224 94.8224 0 0 1 108.4928 0l43.008 30.72a30.72 30.72 0 1 1-35.84 49.92l-42.7008-30.72a32.8704 32.8704 0 0 0-37.632 0l-215.3472 151.3984A94.4128 94.4128 0 0 1 223.8976 931.84z" fill="#363F5B" p-id="27814"></path><path d="M656.5376 384h-288.256a30.72 30.72 0 0 1 0-61.44h288.256a30.72 30.72 0 1 1 0 61.44z" fill="#B11EFF" p-id="27815"></path></svg>            <div class="ml-5">
              <h2 class="mb-1">标签  </h2>
              <CountTo :value="tagTotalCount" />
            </div>
          </div>
      </div>

      <!-- 总浏览量 -->
      <div class="col-span-4 md:col-span-1 ">
        <div class="flex items-center h-full w-full px-5 py-7 mb-3 bg-white border border-gray-200 rounded-lg dark:bg-gray-800 dark:border-gray-700">
            <svg t="1747884870700" class="icon w-10 h-10" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="38872" data-spm-anchor-id="a313x.search_index.0.i32.7d763a818LwCKd" width="200" height="200"><path d="M503.68 200.576c111.232 0 212.352 46.4 292.608 124.096 63.616 61.632 106.176 138.368 106.496 177.344v14.272c-0.32 38.72-42.88 115.328-106.496 176.96-80.256 77.696-181.376 124.16-292.608 124.16-110.912 0-212.096-47.04-292.8-125.632-63.488-61.888-106.304-138.752-106.304-175.488V501.76c0-36.8 42.816-113.664 106.304-175.552C291.584 247.616 392.768 200.576 503.68 200.576M503.68 128c-131.264 0-249.984 55.232-343.424 146.24C84.032 348.416 32 441.92 32 501.76v14.528c0 59.776 52.032 153.28 128.256 227.456 93.44 91.008 212.16 146.176 343.424 146.176 131.392 0 250.048-54.4 343.104-144.448 76.352-73.984 128.064-167.296 128.576-228.928V501.76c-0.512-61.952-52.224-155.264-128.576-229.184C753.728 182.464 635.072 128 503.68 128" fill="#2c2c2c" p-id="38873" data-spm-anchor-id="a313x.search_index.0.i31.7d763a818LwCKd" class=""></path><path d="M503.68 400.128a108.8 108.8 0 1 1 0 217.728 108.8 108.8 0 0 1 0-217.728m0-72.576a181.44 181.44 0 1 0 0 362.88 181.44 181.44 0 0 0 0-362.88" fill="#d323d4" p-id="38874" data-spm-anchor-id="a313x.search_index.0.i30.7d763a818LwCKd" class="selected"></path></svg>            <div class="ml-5">
              <h2 class="mb-1">总浏览量</h2>
              <CountTo :value="pvTotalCount" />
            </div>
          </div>
      </div>

      <!-- 文章发布热点图 -->
      <div class="col-span-4 md:col-span-2">
        <!-- 卡片 -->
        <div class="w-full h-full px-5 py-7 mb-3 bg-white border border-gray-200 rounded-lg dark:bg-gray-800 dark:border-gray-700">
          <h2 class="flex items-center mb-2 font-bold text-gray-600 uppercase dark:text-white">
            <!-- 日历图标 -->
            <svg t="1699867752559" class="icon w-5 h-5 mr-2" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="43935" width="200" height="200"><path d="M897.9 369.2H205c-33.8 0-61.4-27.6-61.4-61.4s27.6-61.4 61.4-61.4h692.9c33.8 0 61.4 27.6 61.4 61.4s-27.6 61.4-61.4 61.4z" fill="#FFB89A" p-id="43936"></path><path d="M807 171H703.3c-16.6 0-30 13.4-30 30s13.4 30 30 30H807c31.6 0 57.4 24 57.4 53.4v42.3H125.2v-42.3c0-29.5 25.7-53.4 57.4-53.4H293c16.6 0 30-13.4 30-30s-13.4-30-30-30H182.5c-64.7 0-117.4 50.9-117.4 113.4v527.7c0 62.5 52.7 113.4 117.4 113.4H807c64.7 0 117.4-50.9 117.4-113.4V284.5c0-62.6-52.7-113.5-117.4-113.5z m0 694.6H182.5c-31.6 0-57.4-24-57.4-53.4V386.8h739.2v425.4c0.1 29.5-25.7 53.4-57.3 53.4z" fill="#45484C" p-id="43937"></path><path d="M447.6 217.1c-12.4-6.1-27-2.8-35.7 7.1-2.2-6.7-4-16.2-4-28.1 0-13 2.2-23 4.6-29.8 9.5 8.1 23.5 9.6 34.9 2.8 14.2-8.5 18.8-27 10.3-41.2-15.5-25.9-35.9-29.7-46.6-29.7-36.6 0-63.1 41.2-63.1 97.8s26.4 98 63 98c20.6 0 39-13.4 50.4-36.7 7.3-14.9 1.1-32.9-13.8-40.2zM635.9 218.5c-12.4-6.1-27-2.8-35.7 7.1-2.2-6.7-4-16.2-4-28.1 0-13 2.2-23 4.6-29.8 9.5 8.1 23.5 9.6 34.9 2.8 14.2-8.5 18.8-27 10.3-41.2-15.5-25.9-35.9-29.7-46.6-29.7-36.6 0-63.1 41.2-63.1 97.8s26.5 97.8 63.1 97.8c20.6 0 39-13.4 50.4-36.7 7.1-14.7 0.9-32.7-13.9-40z" fill="#45484C" p-id="43938"></path><path d="M700.2 514.5H200.5c-16.6 0-30 13.4-30 30s13.4 30 30 30h499.7c16.6 0 30-13.4 30-30s-13.5-30-30-30zM668.4 689.8h-74c-16.6 0-30 13.4-30 30s13.4 30 30 30h74c16.6 0 30-13.4 30-30s-13.4-30-30-30zM479.3 689.8H200.5c-16.6 0-30 13.4-30 30s13.4 30 30 30h278.8c16.6 0 30-13.4 30-30s-13.4-30-30-30z" fill="#33CC99" p-id="43939"></path></svg>
            近半年文章发布热点图
          </h2>
          <ArticlePublishCalendar :value="articlePublishInfo"></ArticlePublishCalendar>
        </div>
      </div>

      <!-- 文章日 PV 访问量折线图 -->
      <div class="col-span-4 md:col-span-2">
        <!-- 卡片 -->
        <div class="w-full h-full px-5 py-7 mb-3 bg-white border border-gray-200 rounded-lg dark:bg-gray-800 dark:border-gray-700">
          <h2 class="flex items-center mb-2 font-bold text-gray-600 uppercase dark:text-white">
            <!-- 折线图标 -->
            <svg t="1699872552774" class="icon w-5 h-5 mr-2" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="58226" width="200" height="200"><path d="M629.892 323.414c-6.226-11.274-18.33-18.156-31.126-17.914-12.796 0.242-24.554 7.608-30.086 19.124l-143.52 286.87-63.29-115.164c-6.224-11.032-17.982-17.914-30.432-17.914h-60.52c-19.022 0-34.584 15.494-34.584 34.584 0 19.09 15.56 34.584 34.582 34.584h40.118l85.074 155c6.226 11.276 18.33 18.158 31.126 17.916 12.796-0.242 24.554-7.608 30.086-19.124l143.52-286.87 63.29 115.164c6.224 11.032 17.982 17.914 30.432 17.914h60.52c19.022 0 34.584-15.494 34.584-34.584 0-19.09-15.56-34.584-34.582-34.584h-40.118l-85.074-155z" fill="#767BFA" p-id="58227"></path><path d="M513 98C854.684 98 928 171.248 928 513S854.684 928 513 928C171.316 928 98 854.752 98 513S171.316 98 513 98z m0 69.166c-83.692 0-146.634 4.6-194.012 15.148-46.688 10.376-74.354 25.592-92.684 43.92-18.33 18.364-33.546 46.032-43.92 92.754-10.72 47.482-15.218 110.148-15.218 194.012s4.496 146.53 15.218 194.012c10.374 46.722 25.59 74.39 43.92 92.754 18.33 18.328 45.996 33.544 92.684 43.92 47.38 10.548 110.32 15.148 194.012 15.148 83.692 0 146.634-4.6 194.012-15.148 46.688-10.376 74.354-25.592 92.684-43.92 18.328-18.364 33.546-46.032 43.92-92.754 10.72-47.482 15.218-110.148 15.218-194.012s-4.496-146.53-15.218-194.012c-10.374-46.722-25.592-74.39-43.92-92.752-18.33-18.33-45.996-33.546-92.684-43.92-47.38-10.55-110.32-15.15-194.012-15.15z" fill="#ABAFD1" p-id="58228"></path></svg>
            近一周 PV 访问量
          </h2>
          <ArticlePVLineChat :value="articlePVInfo"></ArticlePVLineChat>
        </div>
      </div>

    </div>
  </main>
</template>

<script setup>
import { ref } from 'vue'
import CountTo from '@/components/CountTo.vue'
import { getBaseStatisticsInfo, getPublishArticleStatisticsInfo, getArticlePVStatisticsInfo } from '@/api/admin/dashboard'
import ArticlePublishCalendar from '@/components/ArticlePublishCalendar.vue'
import ArticlePVLineChat from '@/components/ArticlePVLineChat.vue'
// 文章总数，默认值为 0
const articleTotalCount = ref(0)
// 分类总数
const categoryTotalCount = ref(0)
// 标签总数
const tagTotalCount = ref(0)
// PV 总访问量
const pvTotalCount= ref(0)

getBaseStatisticsInfo().then(res => {
  if (res.success) {
    console.log(res.data)
    articleTotalCount.value = res.data.articleTotalCount
    categoryTotalCount.value = res.data.categoryTotalCount
    tagTotalCount.value = res.data.tagTotalCount
    pvTotalCount.value = res.data.pvTotalCount
  }
})

// 按日统计文章发布数据
const articlePublishInfo = ref({})
getPublishArticleStatisticsInfo().then((res) => {
  if (res.success) {
    articlePublishInfo.value = res.data
  }
})

// 近一周文章 PV 数据
const articlePVInfo = ref({})
getArticlePVStatisticsInfo().then((res) => {
  if (res.success) {
    articlePVInfo.value = res.data
  }
})
</script>